.insomnia/Request/req_506b0260e391464ba141e54389218b06.yml

_id: req_506b0260e391464ba141e54389218b06
type: Request
parentId: fld_4dcde7e8836d44048eb999ae7ddae2ae
modified: 1661783605883
created: 1632950548148
url: https://191.241.195.16/ws/elementsInformationService
name: GetElementPerformance
description: ""
method: POST
body:
  mimeType: ""
  text: >-
    <?xml version="1.0" encoding="UTF-8"?>

    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="com.gilat.ngnms.server.services.ws.cfg.face">   

    <soapenv:Header/>    

    <soapenv:Body>       

    <com:getElementPerformance>         

    <reportElement>             
        <element>                
            <eType>CPE</eType>                
            <cpeId>                   
                <managedGroupId>7</managedGroupId>                   
                <subscriberId>1360470</subscriberId>                
            </cpeId>             
        </element>             
        <reportType>TX_CAPABILITY</reportType>             
        <resolution>H</resolution>             
        <startDate>1595549154000</startDate>             
        <endDate>1595635554000</endDate>          
    </reportElement>          

    <lastIndex>0</lastIndex>       

    </com:getElementPerformance>    

    </soapenv:Body> 

    </soapenv:Envelope> 
parameters: []
headers:
  - name: Content-Type
    value: text/xml
    id: pair_0df14ec2f7144357a6c0b9dfdcfb8921
authentication:
  type: basic
  disabled: false
  username: telefonica
  password: $telefonica$
metaSortKey: -1632950548148
isPrivate: false
settingStoreCookies: true
settingSendCookies: true
settingDisableRenderRequestBody: false
settingEncodeUrl: true
settingRebuildPath: true
settingFollowRedirects: global
