.insomnia/Request/req_4a4f43164c174f15adc4cd0645b1176d.yml

_id: req_4a4f43164c174f15adc4cd0645b1176d
type: Request
parentId: fld_7c4a08fcb9a24b27bd0a0df89ce1cdb1
modified: 1656003318417
created: 1628608358808
url: https://192.168.188.8/ws/elementsInformationService
name: GetElementPerformance
description: ""
method: POST
body:
  mimeType: ""
  text: >-
    <?xml version="1.0" encoding="UTF-8"?>

    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="com.gilat.ngnms.server.services.ws.cfg.face">   

    <soapenv:Header/>    

    <soapenv:Body>       

    <com:getElementPerformance>         

    <reportElement>             
        <element>                
            <eType>CPE</eType>                
            <cpeId>                   
                <managedGroupId>2</managedGroupId>                   
                <subscriberId>88154</subscriberId>                
            </cpeId>             
        </element>             
        <reportType>LAST_FWD_RX_ESN0</reportType>             
        <resolution>H</resolution>             
        <startDate>1595549154000</startDate>             
        <endDate>1595635554000</endDate>          
    </reportElement>          

    <lastIndex>0</lastIndex>       

    </com:getElementPerformance>    

    </soapenv:Body> 

    </soapenv:Envelope> 
parameters: []
headers:
  - name: Content-Type
    value: text/xml
    id: pair_46a717723a8543d98ccae4c200de1965
authentication:
  type: basic
  disabled: false
  username: apis
  password: apis2020
metaSortKey: -1628608358808
isPrivate: false
settingStoreCookies: true
settingSendCookies: true
settingDisableRenderRequestBody: false
settingEncodeUrl: true
settingRebuildPath: true
settingFollowRedirects: global
